torvalds/linux/arch/arm/boot/dts/nxp/imx/imxrt1050-pinfunc.h
#define MXRT1050_IOMUXC_GPIO_EMC_20_SEMC_ADDR12       0x064 0x254 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_20_FLEXPWM2_PWM3_B     0x064 0x254 0x484 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_EMC_20_LPUART4_RXD       0x064 0x254 0x540 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_EMC_20_ENET_RX_DATA00      0x064 0x254 0x434 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_20_TMR2_TIMER0       0x064 0x254 0x570 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_20_GPIO4_IO20        0x064 0x254 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_21_SEMC_BA0        0x068 0x258 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_21_FLEXPWM3_PWM3_A     0x068 0x258 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_21_LPI2C3_SDA        0x068 0x258 0x4E0 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_21_ENET_TX_DATA01      0x068 0x258 0x000 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_21_TMR2_TIMER2       0x068 0x258 0x574 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_21_GPIO4_IO21        0x068 0x258 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_22_SEMC_BA1        0x06C 0x25C 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_22_FLEXPWM3_PWM3_B     0x06C 0x25C 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_22_LPI2C3_SCL        0x06C 0x25C 0x4DC 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_22_ENET_TX_DATA00      0x06C 0x25C 0x000 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_22_TMR2_TIMER3       0x06C 0x25C 0x578 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_22_GPIO4_IO22        0x06C 0x25C 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_23_SEMC_ADDR10       0x070 0x260 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_23_FLEXPWM1_PWM0_A     0x070 0x260 0x458 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_23_LPUART5_TXD       0x070 0x260 0x54C 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_23_ENET_RX_EN        0x070 0x260 0x43C 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_23_GPT1_CAPTURE2     0x070 0x260 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_23_GPIO4_IO23        0x070 0x260 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_24_SEMC_CAS        0x074 0x264 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_24_FLEXPWM1_PWM0_B     0x074 0x264 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_24_LPUART5_RXD       0x074 0x264 0x548 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_24_ENET_TX_EN        0x074 0x264 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_24_GPT1_CAPTURE1     0x074 0x264 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_24_GPIO4_IO24        0x074 0x264 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_25_SEMC_RAS        0x078 0x268 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_25_FLEXPWM1_PWM1_A     0x078 0x268 0x45C 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_25_LPUART6_TXD       0x078 0x268 0x554 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_25_ENET_TX_CLK       0x078 0x268 0x448 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_25_ENET_REF_CLK      0x078 0x268 0x42C 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_25_GPIO4_IO25        0x078 0x268 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_26_SEMC_CLK        0x07C 0x26C 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_26_FLEXPWM1_PWM1_B     0x07C 0x26C 0x46C 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_26_LPUART6_RXD       0x07C 0x26C 0x550 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_26_ENET_RX_ER        0x07C 0x26C 0x440 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_26_FLEXIO1_D12       0x07C 0x26C 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_26_GPIO4_IO26        0x07C 0x26C 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_27_SEMC_CKE        0x080 0x270 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_27_FLEXPWM1_PWM2_A     0x080 0x270 0x460 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_27_LPUART5_RTS_B     0x080 0x270 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_27_LPSPI1_SCK        0x080 0x270 0x4F0 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_27_FLEXIO1_D13       0x080 0x270 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_27_GPIO4_IO27        0x080 0x270 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_28_SEMC_WE       0x084 0x274 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_28_FLEXPWM1_PWM2_B     0x084 0x274 0x470 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_28_LPUART5_CTS_B     0x084 0x274 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_28_LPSPI1_SDO        0x084 0x274 0x4F8 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_28_FLEXIO1_D14       0x084 0x274 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_28_GPIO4_IO28        0x084 0x274 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_29_SEMC_CS0        0x088 0x278 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_29_FLEXPWM3_PWM0_A     0x088 0x278 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_29_LPUART6_RTS_B     0x088 0x278 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_29_LPSPI1_SDI        0x088 0x278 0x4F4 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_29_FLEXIO1_D15       0x088 0x278 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_29_GPIO4_IO29        0x088 0x278 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_30_SEMC_DA08       0x08C 0x27C 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_30_FLEXPWM3_PWM0_B     0x08C 0x27C 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_30_LPUART6_CTS_B     0x08C 0x27C 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_30_LPSPI1_PCS0       0x08C 0x27C 0x4EC 0x3 0x1
#define MXRT1050_IOMUXC_GPIO_EMC_30_CSI_DATA23        0x08C 0x27C 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_30_GPIO4_IO30        0x08C 0x27C 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_31_SEMC_DA09       0x090 0x280 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_31_FLEXPWM3_PWM1_A     0x090 0x280 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_31_LPUART7_TXD       0x090 0x280 0x55C 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_EMC_31_LPSPI1_PCS1       0x090 0x280 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_31_CSI_DATA22        0x090 0x280 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_31_GPIO4_IO31        0x090 0x280 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_32_SEMC_DA10       0x094 0x284 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_32_FLEXPWM3_PWM1_B     0x094 0x284 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_32_LPUART7_RXD       0x094 0x284 0x558 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_EMC_32_CCM_PMIC_READY      0x094 0x284 0x3FC 0x3 \
  0x4
#define MXRT1050_IOMUXC_GPIO_EMC_32_CSI_DATA21        0x094 0x284 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_32_GPIO3_IO18        0x094 0x284 0x000 0x5 0x0

