torvalds/linux/arch/arm/boot/dts/nxp/imx/imxrt1050-pinfunc.h
#define MXRT1050_IOMUXC_GPIO_EMC_33_SEMC_DA11       0x098 0x288 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_33_FLEXPWM3_PWM2_A     0x098 0x288 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_33_USDHC1_RESET_B      0x098 0x288 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_33_SAI3_RX_DATA      0x098 0x288 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_33_CSI_DATA20        0x098 0x288 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_33_GPIO3_IO19        0x098 0x288 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_34_SEMC_DA12       0x09C 0x28C 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_34_FLEXPWM3_PWM2_B     0x09C 0x28C 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_34_USDHC1_VSELECT      0x09C 0x28C 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_EMC_34_SAI3_RX_SYNC      0x09C 0x28C 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_34_CSI_DATA19        0x09C 0x28C 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_34_GPIO3_IO20        0x09C 0x28C 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_35_SEMC_DA13       0x0A0 0x290 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_35_XBAR_INOUT18      0x0A0 0x290 0x630 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_35_GPT1_COMPARE1     0x0A0 0x290 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_35_SAI3_RX_BCLK      0x0A0 0x290 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_35_CSI_DATA18        0x0A0 0x290 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_35_GPIO3_IO21        0x0A0 0x290 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_35_USDHC1_CD_B       0x0A0 0x290 0x5D4 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_36_SEMC_DA14       0x0A4 0x294 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_36_XBAR_INOUT22      0x0A4 0x294 0x638 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_36_GPT1_COMPARE2     0x0A4 0x294 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_36_SAI3_TX_DATA      0x0A4 0x294 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_36_CSI_DATA17        0x0A4 0x294 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_36_GPIO3_IO22        0x0A4 0x294 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_36_USDHC1_WP       0x0A4 0x294 0x5D8 0x6 0x1

#define MXRT1050_IOMUXC_GPIO_EMC_37_SEMC_DA15       0x0A8 0x298 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_37_XBAR_INOUT23      0x0A8 0x298 0x63C 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_37_GPT1_COMPARE3     0x0A8 0x298 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_37_SAI3_MCLK       0x0A8 0x298 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_37_CSI_DATA16        0x0A8 0x298 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_37_GPIO3_IO23        0x0A8 0x298 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_37_USDHC2_WP       0x0A8 0x298 0x608 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_EMC_38_SEMC_DM01       0x0AC 0x29C 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_38_FLEXPWM1_PWM3_A     0x0AC 0x29C 0x454 0x1 \
  0x2
#define MXRT1050_IOMUXC_GPIO_EMC_38_LPUART8_TXD       0x0AC 0x29C 0x564 0x2 0x2
#define MXRT1050_IOMUXC_GPIO_EMC_38_SAI3_TX_BCLK      0x0AC 0x29C 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_38_CSI_FIELD       0x0AC 0x29C 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_38_GPIO3_IO24        0x0AC 0x29C 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_38_USDHC2_VSELECT      0x0AC 0x29C 0x000 0x6 \
  0x0

#define MXRT1050_IOMUXC_GPIO_EMC_39_SEMC_DQS        0x0B0 0x2A0 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_39_FLEXPWM1_PWM3_B     0x0B0 0x2A0 0x464 0x1 \
  0x2
#define MXRT1050_IOMUXC_GPIO_EMC_39_LPUART8_RXD       0x0B0 0x2A0 0x560 0x2 0x2
#define MXRT1050_IOMUXC_GPIO_EMC_39_SAI3_TX_SYNC      0x0B0 0x2A0 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_39_WDOG1_B       0x0B0 0x2A0 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_39_GPIO3_IO25        0x0B0 0x2A0 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_39_USDHC2_CD_B       0x0B0 0x2A0 0x5E0 0x6 0x1

#define MXRT1050_IOMUXC_GPIO_EMC_40_SEMC_RDY        0x0B4 0x2A4 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_40_GPT2_CAPTURE2     0x0B4 0x2A4 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_40_LPSPI1_PCS2       0x0B4 0x2A4 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_40_USB_OTG2_OC       0x0B4 0x2A4 0x5CC 0x3 0x1
#define MXRT1050_IOMUXC_GPIO_EMC_40_ENET_MDC        0x0B4 0x2A4 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_40_GPIO3_IO26        0x0B4 0x2A4 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_40_USDHC2_RESET_B      0x0B4 0x2A4 0x000 0x6 \
  0x0

#define MXRT1050_IOMUXC_GPIO_EMC_41_SEMC_CSX0       0x0B8 0x2A8 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_41_GPT2_CAPTURE1     0x0B8 0x2A8 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_41_LPSPI1_PCS3       0x0B8 0x2A8 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_41_USB_OTG2_PWR      0x0B8 0x2A8 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_41_ENET_MDIO       0x0B8 0x2A8 0x430 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_EMC_41_GPIO3_IO27        0x0B8 0x2A8 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_EMC_41_USDHC2_VSELECT      0x0B8 0x2A8 0x000 0x6 \
  0x0

#define MXRT1050_IOMUXC_GPIO_AD_B0_00_FLEXPWM2_PWM3_A     0x0BC 0x2AC 0x000 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_XBAR_INOUT14      0x0BC 0x2AC 0x644 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_REF_CLK_32K     0x0BC 0x2AC 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_USB_OTG2_ID     0x0BC 0x2AC 0x3F8 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_LPI2C1_SCLS     0x0BC 0x2AC 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_GPIO1_IO00      0x0BC 0x2AC 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_USDHC1_RESET_B      0x0BC 0x2AC 0x000 0x6 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_00_LPSPI3_SCK      0x0BC 0x2AC 0x510 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B0_01_FLEXPWM2_PWM3_B     0x0C0 0x2B0 0x484 0x0 \
  0x2
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_XBAR_INOUT15      0x0C0 0x2B0 0x648 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_REF_CLK_24M     0x0C0 0x2B0 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_USB_OTG1_ID     0x0C0 0x2B0 0x3F4 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_LPI2C1_SDAS     0x0C0 0x2B0 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_GPIO1_IO01      0x0C0 0x2B0 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_EWM_OUT_B       0x0C0 0x2B0 0x000 0x6 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_01_LPSPI3_SDO      0x0C0 0x2B0 0x518 0x7 0x1

#define MXRT1050_IOMUXC_GPIO_AD_B0_02_FLEXCAN2_TX     0x0C4 0x2B4 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_XBAR_INOUT16      0x0C4 0x2B4 0x64C 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_LPUART6_TXD     0x0C4 0x2B4 0x554 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_USB_OTG1_PWR      0x0C4 0x2B4 0x000 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_FLEXPWM1_PWM0_X     0x0C4 0x2B4 0x000 0x4 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_GPIO1_IO02      0x0C4 0x2B4 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_LPI2C1_HREQ     0x0C4 0x2B4 0x000 0x6 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_02_LPSPI3_SDI      0x0C4 0x2B4 0x514 0x7 0x1

#define MXRT1050_IOMUXC_GPIO_AD_B0_03_FLEXCAN2_RX     0x0C8 0x2B8 0x450 0x0 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_XBAR_INOUT17      0x0C8 0x2B8 0x62C 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_LPUART6_RXD     0x0C8 0x2B8 0x550 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_USB_OTG1_OC     0x0C8 0x2B8 0x5D0 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_FLEXPWM1_PWM1_X     0x0C8 0x2B8 0x000 0x4 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_GPIO1_IO03      0x0C8 0x2B8 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_REF_CLK_24M     0x0C8 0x2B8 0x000 0x6 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_03_LPSPI3_PCS0     0x0C8 0x2B8 0x50C 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B0_04_SRC_BOOT_MODE00     0x0CC 0x2BC 0x000 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_MQS_RIGHT       0x0CC 0x2BC 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_ENET_TX_DATA03      0x0CC 0x2BC 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_SAI2_TX_SYNC      0x0CC 0x2BC 0x5C4 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_CSI_DATA09      0x0CC 0x2BC 0x41C 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_GPIO1_IO04      0x0CC 0x2BC 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_PIT_TRIGGER00     0x0CC 0x2BC 0x000 0x6 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_04_LPSPI3_PCS1     0x0CC 0x2BC 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B0_05_SRC_BOOT_MODE01     0x0D0 0x2C0 0x000 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_MQS_LEFT        0x0D0 0x2C0 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_ENET_TX_DATA02      0x0D0 0x2C0 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_SAI2_TX_BCLK      0x0D0 0x2C0 0x5C0 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_CSI_DATA08      0x0D0 0x2C0 0x418 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_GPIO1_IO05      0x0D0 0x2C0 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_XBAR_INOUT17      0x0D0 0x2C0 0x62C 0x6 \
  0x2
#define MXRT1050_IOMUXC_GPIO_AD_B0_05_LPSPI3_PCS2     0x0D0 0x2C0 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B0_06_JTAG_TMS        0x0D4 0x2C4 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_GPT2_COMPARE1     0x0D4 0x2C4 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_ENET_RX_CLK     0x0D4 0x2C4 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_SAI2_RX_BCLK      0x0D4 0x2C4 0x5B4 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_CSI_DATA07      0x0D4 0x2C4 0x414 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_GPIO1_IO06      0x0D4 0x2C4 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_XBAR_INOUT18      0x0D4 0x2C4 0x630 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_06_LPSPI3_PCS3     0x0D4 0x2C4 0x000 0x7 0x0

