torvalds/linux/arch/arm/boot/dts/nxp/imx/imxrt1050-pinfunc.h
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_JTAG_TCK        0x0D8 0x2C8 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_GPT2_COMPARE2     0x0D8 0x2C8 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_ENET_TX_ER      0x0D8 0x2C8 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_SAI2_RX_SYNC      0x0D8 0x2C8 0x5BC 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_CSI_DATA06      0x0D8 0x2C8 0x410 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_GPIO1_IO07      0x0D8 0x2C8 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_XBAR_INOUT19      0x0D8 0x2C8 0x654 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_07_ENET_1588_EVENT3_OUT    0x0D8 0x2C8 0x000 \
  0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B0_08_JTAG_MOD        0x0DC 0x2CC 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_GPT2_COMPARE3     0x0DC 0x2CC 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_ENET_RX_DATA03      0x0DC 0x2CC 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_SAI2_RX_DATA      0x0DC 0x2CC 0x5B8 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_CSI_DATA05      0x0DC 0x2CC 0x40C 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_GPIO1_IO08      0x0DC 0x2CC 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_XBAR_INOUT20      0x0DC 0x2CC 0x634 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_08_ENET_1588_EVENT3_IN   0x0DC 0x2CC 0x000 \
  0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B0_09_JTAG_TDI        0x0E0 0x2D0 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_FLEXPWM2_PWM3_A     0x0E0 0x2D0 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_ENET_RX_DATA02      0x0E0 0x2D0 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_SAI2_TX_DATA      0x0E0 0x2D0 0x000 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_CSI_DATA04      0x0E0 0x2D0 0x408 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_GPIO1_IO09      0x0E0 0x2D0 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_XBAR_INOUT21      0x0E0 0x2D0 0x658 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_09_GPT2_CLK        0x0E0 0x2D0 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B0_10_JTAG_TDO        0x0E4 0x2D4 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_FLEXPWM1_PWM3_A     0x0E4 0x2D4 0x454 0x1 \
  0x3
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_ENET_CRS        0x0E4 0x2D4 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_SAI2_MCLK       0x0E4 0x2D4 0x5B0 0x3 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_CSI_DATA03      0x0E4 0x2D4 0x404 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_GPIO1_IO10      0x0E4 0x2D4 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_XBAR_INOUT22      0x0E4 0x2D4 0x638 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_10_ENET_1588_EVENT0_OUT    0x0E4 0x2D4 0x000 \
  0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B0_11_JTAG_TRSTB      0x0E8 0x2D8 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_FLEXPWM1_PWM3_B     0x0E8 0x2D8 0x464 0x1 \
  0x3
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_ENET_COL        0x0E8 0x2D8 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_WDOG1_B       0x0E8 0x2D8 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_CSI_DATA02      0x0E8 0x2D8 0x400 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_GPIO1_IO11      0x0E8 0x2D8 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_XBAR_INOUT23      0x0E8 0x2D8 0x63C 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_11_ENET_1588_EVENT0_IN   0x0E8 0x2D8 0x444 \
  0x7 0x1

#define MXRT1050_IOMUXC_GPIO_AD_B0_12_LPI2C4_SCL      0x0EC 0x2DC 0x4E4 0x0 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_CCM_PMIC_READY      0x0EC 0x2DC 0x3FC 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_LPUART1_TXD     0x0EC 0x2DC 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_WDOG2_B       0x0EC 0x2DC 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_FLEXPWM1_PWM2_X     0x0EC 0x2DC 0x000 0x4 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_GPIO1_IO12      0x0EC 0x2DC 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_ENET_1588_EVENT1_OUT    0x0EC 0x2DC 0x000 \
  0x6 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_12_NMI       0x0EC 0x2DC 0x568 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B0_13_LPI2C4_SDA      0x0F0 0x2E0 0x4E8 0x0 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_GPT1_CLK        0x0F0 0x2E0 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_LPUART1_RXD     0x0F0 0x2E0 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_EWM_OUT_B       0x0F0 0x2E0 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_FLEXPWM1_PWM3_X     0x0F0 0x2E0 0x000 0x4 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_GPIO1_IO13      0x0F0 0x2E0 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_ENET_1588_EVENT1_IN   0x0F0 0x2E0 0x000 \
  0x6 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_13_REF_CLK_24M     0x0F0 0x2E0 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B0_14_USB_OTG2_OC     0x0F4 0x2E4 0x5CC 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_14_XBAR_INOUT24      0x0F4 0x2E4 0x640 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B0_14_LPUART1_CTS_B     0x0F4 0x2E4 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_14_ENET_1588_EVENT0_OUT    0x0F4 0x2E4 0x000 \
  0x3 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_14_CSI_VSYNC       0x0F4 0x2E4 0x428 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_14_GPIO1_IO14      0x0F4 0x2E4 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_14_FLEXCAN2_TX     0x0F4 0x2E4 0x000 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B0_15_USB_OTG2_PWR      0x0F8 0x2E8 0x000 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_XBAR_INOUT25      0x0F8 0x2E8 0x650 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_LPUART1_RTS_B     0x0F8 0x2E8 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_ENET_1588_EVENT0_IN   0x0F8 0x2E8 0x444 \
  0x3 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_CSI_HSYNC       0x0F8 0x2E8 0x420 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_GPIO1_IO15      0x0F8 0x2E8 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_FLEXCAN2_RX     0x0F8 0x2E8 0x450 0x6 0x2
#define MXRT1050_IOMUXC_GPIO_AD_B0_15_WDOG1_WDOG_RST_B_DEB    0x0F8 0x2E8 0x000 \
  0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_00_USB_OTG2_ID     0x0FC 0x2EC 0x3F8 0x0 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_TMR3_TIMER0     0x0FC 0x2EC 0x57C 0x1 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_LPUART2_CTS_B     0x0FC 0x2EC 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL      0x0FC 0x2EC 0x4CC 0x3 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_WDOG1_B       0x0FC 0x2EC 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_GPIO1_IO16      0x0FC 0x2EC 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_USDHC1_WP       0x0FC 0x2EC 0x5D8 0x6 0x2
#define MXRT1050_IOMUXC_GPIO_AD_B1_00_KPP_ROW07       0x0FC 0x2EC 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_01_USB_OTG1_PWR      0x100 0x2F0 0x000 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_TMR3_TIMER1     0x100 0x2F0 0x580 0x1 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_LPUART2_RTS_B     0x100 0x2F0 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA      0x100 0x2F0 0x4D0 0x3 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_CCM_PMIC_READY      0x100 0x2F0 0x3FC 0x4 \
  0x2
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_GPIO1_IO17      0x100 0x2F0 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_USDHC1_VSELECT      0x100 0x2F0 0x000 0x6 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_01_KPP_COL07       0x100 0x2F0 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_02_USB_OTG1_ID     0x104 0x2F4 0x3F4 0x0 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_TMR3_TIMER2     0x104 0x2F4 0x584 0x1 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_LPUART2_TXD     0x104 0x2F4 0x530 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_SPDIF_OUT       0x104 0x2F4 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_ENET_1588_EVENT2_OUT    0x104 0x2F4 0x000 \
  0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_GPIO1_IO18      0x104 0x2F4 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_USDHC1_CD_B     0x104 0x2F4 0x5D4 0x6 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_02_KPP_ROW06       0x104 0x2F4 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_03_USB_OTG1_OC     0x108 0x2F8 0x5D0 0x0 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_TMR3_TIMER3     0x108 0x2F8 0x588 0x1 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_LPUART2_RXD     0x108 0x2F8 0x52C 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_SPDIF_IN        0x108 0x2F8 0x5C8 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_ENET_1588_EVENT2_IN   0x108 0x2F8 0x000 \
  0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_GPIO1_IO19      0x108 0x2F8 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_USDHC2_CD_B     0x108 0x2F8 0x5E0 0x6 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_03_KPP_COL06       0x108 0x2F8 0x000 0x7 0x0

