torvalds/linux/arch/arm/boot/dts/nxp/imx/imxrt1050-pinfunc.h
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_FLEXSPI_B_DATA3     0x10C 0x2FC 0x4C4 0x0 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_ENET_MDC        0x10C 0x2FC 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_LPUART3_CTS_B     0x10C 0x2FC 0x534 0x2 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_SPDIF_SR_CLK      0x10C 0x2FC 0x000 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_CSI_PIXCLK      0x10C 0x2FC 0x424 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_GPIO1_IO20      0x10C 0x2FC 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_USDHC2_DATA0      0x10C 0x2FC 0x5E8 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_04_KPP_ROW05       0x10C 0x2FC 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_05_FLEXSPI_B_DATA2     0x110 0x300 0x4C0 0x0 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_ENET_MDIO       0x110 0x300 0x430 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_LPUART3_RTS_B     0x110 0x300 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_SPDIF_OUT       0x110 0x300 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_CSI_MCLK        0x110 0x300 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_GPIO1_IO21      0x110 0x300 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_USDHC2_DATA1      0x110 0x300 0x5EC 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_05_KPP_COL05       0x110 0x300 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_06_FLEXSPI_B_DATA1     0x114 0x304 0x4BC 0x0 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_LPI2C3_SDA      0x114 0x304 0x4E0 0x1 0x2
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_LPUART3_TXD     0x114 0x304 0x53C 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_SPDIF_LOCK      0x114 0x304 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_CSI_VSYNC       0x114 0x304 0x428 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_GPIO1_IO22      0x114 0x304 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_USDHC2_DATA2      0x114 0x304 0x5F0 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_06_KPP_ROW04       0x114 0x304 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_07_FLEXSPI_B_DATA0     0x118 0x308 0x4B8 0x0 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_LPI2C3_SCL      0x118 0x308 0x4DC 0x1 0x2
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_LPUART3_RXD     0x118 0x308 0x538 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_SPDIF_EXT_CLK     0x118 0x308 0x000 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_CSI_HSYNC       0x118 0x308 0x420 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_GPIO1_IO23      0x118 0x308 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_USDHC2_DATA3      0x118 0x308 0x5F4 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_07_KPP_COL04       0x118 0x308 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_08_FLEXSPI_A_SS1_B     0x11C 0x30C 0x000 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_FLEXPWM4_PWM0_A     0x11C 0x30C 0x494 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_FLEXCAN1_TX     0x11C 0x30C 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_CCM_PMIC_READY      0x11C 0x30C 0x3FC 0x3 \
  0x3
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_CSI_DATA09      0x11C 0x30C 0x41C 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_GPIO1_IO24      0x11C 0x30C 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_USDHC2_CMD      0x11C 0x30C 0x5E4 0x6 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_08_KPP_ROW03       0x11C 0x30C 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_09_FLEXSPI_A_DQS     0x120 0x310 0x4A4 0x0 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_09_FLEXPWM4_PWM1_A     0x120 0x310 0x498 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_09_FLEXCAN1_RX     0x120 0x310 0x44C 0x2 0x2
#define MXRT1050_IOMUXC_GPIO_AD_B1_09_SAI1_MCLK       0x120 0x310 0x58C 0x3 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_09_CSI_DATA08      0x120 0x310 0x418 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_09_GPIO1_IO25      0x120 0x310 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_09_USDHC2_CLK      0x120 0x310 0x5DC 0x6 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_09_KPP_COL03       0x120 0x310 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_10_FLEXSPI_A_DATA3     0x124 0x314 0x4B4 0x0 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_10_WDOG1_B       0x124 0x314 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_10_LPUART8_TXD     0x124 0x314 0x564 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_10_SAI1_RX_SYNC      0x124 0x314 0x5A4 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_10_CSI_DATA07      0x124 0x314 0x414 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_10_GPIO1_IO26      0x124 0x314 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_10_USDHC2_WP       0x124 0x314 0x608 0x6 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_10_KPP_ROW02       0x124 0x314 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_11_FLEXSPI_A_DATA2     0x128 0x318 0x4B0 0x0 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_11_EWM_OUT_B       0x128 0x318 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_11_LPUART8_RXD     0x128 0x318 0x560 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_11_SAI1_RX_BCLK      0x128 0x318 0x590 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_11_CSI_DATA06      0x128 0x318 0x410 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_11_GPIO1_IO27      0x128 0x318 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_11_USDHC2_RESET_B      0x128 0x318 0x000 0x6 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_11_KPP_COL02       0x128 0x318 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_12_FLEXSPI_A_DATA1     0x12C 0x31C 0x4AC 0x0 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_12_ACMP1_OUT       0x12C 0x31C 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_12_LPSPI3_PCS0     0x12C 0x31C 0x50C 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_12_SAI1_RX_DATA00      0x12C 0x31C 0x594 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_12_CSI_DATA05      0x12C 0x31C 0x40C 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_12_GPIO1_IO28      0x12C 0x31C 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_12_USDHC2_DATA4      0x12C 0x31C 0x5F8 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_12_KPP_ROW01       0x12C 0x31C 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_13_FLEXSPI_A_DATA0     0x130 0x320 0x4A8 0x0 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_13_ACMP2_OUT       0x130 0x320 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_13_LPSPI3_SDI      0x130 0x320 0x514 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_13_SAI1_TX_DATA00      0x130 0x320 0x000 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_13_CSI_DATA04      0x130 0x320 0x408 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_13_GPIO1_IO29      0x130 0x320 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_13_USDHC2_DATA5      0x130 0x320 0x5FC 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_13_KPP_COL01       0x130 0x320 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_14_FLEXSPI_A_SCLK      0x134 0x324 0x4C8 0x0 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_14_ACMP3_OUT       0x134 0x324 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_14_LPSPI3_SDO      0x134 0x324 0x518 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_14_SAI1_TX_BCLK      0x134 0x324 0x5A8 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_14_CSI_DATA03      0x134 0x324 0x404 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_14_GPIO1_IO30      0x134 0x324 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_14_USDHC2_DATA6      0x134 0x324 0x600 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_14_KPP_ROW00       0x134 0x324 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_AD_B1_15_FLEXSPI_A_SS0_B     0x138 0x328 0x000 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_15_ACMP4_OUT       0x138 0x328 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_15_LPSPI3_SCK      0x138 0x328 0x510 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_15_SAI1_TX_SYNC      0x138 0x328 0x5AC 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_15_CSI_DATA02      0x138 0x328 0x400 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_15_GPIO1_IO31      0x138 0x328 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_AD_B1_15_USDHC2_DATA7      0x138 0x328 0x604 0x6 \
  0x1
#define MXRT1050_IOMUXC_GPIO_AD_B1_15_KPP_COL00       0x138 0x328 0x000 0x7 0x0

#define MXRT1050_IOMUXC_GPIO_B0_00_LCD_CLK        0x13C 0x32C 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_B0_00_TMR1_TIMER0        0x13C 0x32C 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_B0_00_MQS_RIGHT        0x13C 0x32C 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_B0_00_LPSPI4_PCS0        0x13C 0x32C 0x51C 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_B0_00_FLEXIO2_D00        0x13C 0x32C 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_B0_00_GPIO2_IO00       0x13C 0x32C 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_B0_00_SEMC_CSX1        0x13C 0x32C 0x000 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_B0_01_LCD_ENABLE       0x140 0x330 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_B0_01_TMR1_TIMER1        0x140 0x330 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_B0_01_MQS_LEFT       0x140 0x330 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_B0_01_LPSPI4_SDI       0x140 0x330 0x524 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_B0_01_FLEXIO2_D01        0x140 0x330 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_B0_01_GPIO2_IO01       0x140 0x330 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_B0_01_SEMC_CSX2        0x140 0x330 0x000 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_B0_02_LCD_HSYNC        0x144 0x334 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_B0_02_TMR1_TIMER2        0x144 0x334 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_B0_02_FLEXCAN1_TX        0x144 0x334 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_B0_02_LPSPI4_SDO       0x144 0x334 0x528 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_B0_02_FLEXIO2_D02        0x144 0x334 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_B0_02_GPIO2_IO02       0x144 0x334 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_B0_02_SEMC_CSX3        0x144 0x334 0x000 0x6 0x0

