torvalds/linux/arch/arm/boot/dts/nxp/imx/imxrt1050-pinfunc.h
#define MXRT1050_IOMUXC_GPIO_B1_08_LCD_DATA20       0x19C 0x38C 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_B1_08_TMR1_TIMER3        0x19C 0x38C 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_B1_08_CSI_DATA11       0x19C 0x38C 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_B1_08_ENET_TX_DATA01     0x19C 0x38C 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_B1_08_FLEXIO2_D24        0x19C 0x38C 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_B1_08_GPIO2_IO24       0x19C 0x38C 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_B1_08_FLEXCAN2_TX        0x19C 0x38C 0x000 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_B1_09_LCD_DATA21       0x1A0 0x390 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_B1_09_TMR2_TIMER3        0x1A0 0x390 0x578 0x1 0x1
#define MXRT1050_IOMUXC_GPIO_B1_09_CSI_DATA10       0x1A0 0x390 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_B1_09_ENET_TX_EN       0x1A0 0x390 0x000 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_B1_09_FLEXIO2_D25        0x1A0 0x390 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_B1_09_GPIO2_IO25       0x1A0 0x390 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_B1_09_FLEXCAN2_RX        0x1A0 0x390 0x450 0x6 0x3

#define MXRT1050_IOMUXC_GPIO_B1_10_LCD_DATA22       0x1A4 0x394 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_B1_10_TMR3_TIMER3        0x1A4 0x394 0x588 0x1 0x2
#define MXRT1050_IOMUXC_GPIO_B1_10_CSI_DATA00       0x1A4 0x394 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_B1_10_ENET_TX_CLK        0x1A4 0x394 0x448 0x3 0x1
#define MXRT1050_IOMUXC_GPIO_B1_10_FLEXIO2_D26        0x1A4 0x394 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_B1_10_GPIO2_IO26       0x1A4 0x394 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_B1_10_ENET_REF_CLK       0x1A4 0x394 0x42C 0x6 0x1

#define MXRT1050_IOMUXC_GPIO_B1_11_LCD_DATA23       0x1A8 0x398 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_B1_11_TMR4_TIMER3        0x1A8 0x398 0x000 0x1 0x0
#define MXRT1050_IOMUXC_GPIO_B1_11_CSI_DATA01       0x1A8 0x398 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_B1_11_ENET_RX_ER       0x1A8 0x398 0x440 0x3 0x1
#define MXRT1050_IOMUXC_GPIO_B1_11_FLEXIO2_D27        0x1A8 0x398 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_B1_11_GPIO2_IO27       0x1A8 0x398 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_B1_11_LPSPI4_PCS3        0x1A8 0x398 0x000 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_B1_12_LPUART5_TXD        0x1AC 0x39C 0x54C 0x1 0x1
#define MXRT1050_IOMUXC_GPIO_B1_12_CSI_PIXCLK       0x1AC 0x39C 0x424 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_B1_12_ENET_1588_EVENT0_IN      0x1AC 0x39C 0x444 \
  0x3 0x2
#define MXRT1050_IOMUXC_GPIO_B1_12_FLEXIO2_D28        0x1AC 0x39C 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_B1_12_GPIO2_IO28       0x1AC 0x39C 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_B1_12_USDHC1_CD_B        0x1AC 0x39C 0x5D4 0x6 0x2

#define MXRT1050_IOMUXC_GPIO_B1_13_WDOG1_B        0x1B0 0x3A0 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_B1_13_LPUART5_RXD        0x1B0 0x3A0 0x548 0x1 0x1
#define MXRT1050_IOMUXC_GPIO_B1_13_CSI_VSYNC        0x1B0 0x3A0 0x428 0x2 0x2
#define MXRT1050_IOMUXC_GPIO_B1_13_ENET_1588_EVENT0_OUT     0x1B0 0x3A0 0x000 \
  0x3 0x0
#define MXRT1050_IOMUXC_GPIO_B1_13_FLEXIO2_D29        0x1B0 0x3A0 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_B1_13_GPIO2_IO29       0x1B0 0x3A0 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_B1_13_USDHC1_WP        0x1B0 0x3A0 0x5D8 0x6 0x3

#define MXRT1050_IOMUXC_GPIO_B1_14_ENET_MDC       0x1B4 0x3A4 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_B1_14_FLEXPWM4_PWM2_A      0x1B4 0x3A4 0x49C 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_B1_14_CSI_HSYNC        0x1B4 0x3A4 0x420 0x2 0x2
#define MXRT1050_IOMUXC_GPIO_B1_14_XBAR_INOUT02       0x1B4 0x3A4 0x60C 0x3 0x1
#define MXRT1050_IOMUXC_GPIO_B1_14_FLEXIO2_D30        0x1B4 0x3A4 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_B1_14_GPIO2_IO30       0x1B4 0x3A4 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_B1_14_USDHC1_VSELECT     0x1B4 0x3A4 0x000 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_B1_15_ENET_MDIO        0x1B8 0x3A8 0x430 0x0 0x2
#define MXRT1050_IOMUXC_GPIO_B1_15_FLEXPWM4_PWM3_A      0x1B8 0x3A8 0x4A0 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_B1_15_CSI_MCLK       0x1B8 0x3A8 0x000 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_B1_15_XBAR_INOUT03       0x1B8 0x3A8 0x610 0x3 0x1
#define MXRT1050_IOMUXC_GPIO_B1_15_FLEXIO2_D31        0x1B8 0x3A8 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_B1_15_GPIO2_IO31       0x1B8 0x3A8 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_B1_15_USDHC1_RESET_B     0x1B8 0x3A8 0x000 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B0_00_USDHC1_CMD      0x1BC 0x3AC 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_00_FLEXPWM1_PWM0_A     0x1BC 0x3AC 0x458 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_00_LPI2C3_SCL      0x1BC 0x3AC 0x4DC 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_00_XBAR_INOUT04      0x1BC 0x3AC 0x614 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_00_LPSPI1_SCK      0x1BC 0x3AC 0x4F0 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_00_GPIO3_IO12      0x1BC 0x3AC 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_00_FLEXSPI_A_SS1_B     0x1BC 0x3AC 0x000 0x6 \
  0x0

#define MXRT1050_IOMUXC_GPIO_SD_B0_01_USDHC1_CLK      0x1C0 0x3B0 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_01_FLEXPWM1_PWM0_B     0x1C0 0x3B0 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_01_LPI2C3_SDA      0x1C0 0x3B0 0x4E0 0x2 0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_01_XBAR_INOUT05      0x1C0 0x3B0 0x618 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_01_LPSPI1_PCS0     0x1C0 0x3B0 0x4EC 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_01_GPIO3_IO13      0x1C0 0x3B0 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_01_FLEXSPI_B_SS1_B     0x1C0 0x3B0 0x000 0x6 \
  0x0

#define MXRT1050_IOMUXC_GPIO_SD_B0_02_USDHC1_DATA0      0x1C4 0x3B4 0x000 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_02_FLEXPWM1_PWM1_A     0x1C4 0x3B4 0x45C 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_02_LPUART8_CTS_B     0x1C4 0x3B4 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_02_XBAR_INOUT06      0x1C4 0x3B4 0x61C 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_02_LPSPI1_SDO      0x1C4 0x3B4 0x4F8 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_02_GPIO3_IO14      0x1C4 0x3B4 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B0_03_USDHC1_DATA1      0x1C8 0x3B8 0x000 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_03_FLEXPWM1_PWM1_B     0x1C8 0x3B8 0x46C 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_03_LPUART8_RTS_B     0x1C8 0x3B8 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_03_XBAR_INOUT07      0x1C8 0x3B8 0x620 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_03_LPSPI1_SDI      0x1C8 0x3B8 0x4F4 0x4 0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_03_GPIO3_IO15      0x1C8 0x3B8 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B0_04_USDHC1_DATA2      0x1CC 0x3BC 0x000 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_04_FLEXPWM1_PWM2_A     0x1CC 0x3BC 0x460 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_04_LPUART8_TXD     0x1CC 0x3BC 0x564 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_04_XBAR_INOUT08      0x1CC 0x3BC 0x624 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_04_FLEXSPI_B_SS0_B     0x1CC 0x3BC 0x000 0x4 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_04_GPIO3_IO16      0x1CC 0x3BC 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_04_CCM_CLKO1       0x1CC 0x3BC 0x000 0x6 0x0

