torvalds/linux/arch/arm/boot/dts/nxp/imx/imxrt1050-pinfunc.h
#define MXRT1050_IOMUXC_GPIO_SD_B0_05_USDHC1_DATA3      0x1D0 0x3C0 0x000 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_05_FLEXPWM1_PWM2_B     0x1D0 0x3C0 0x470 0x1 \
  0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_05_LPUART8_RXD     0x1D0 0x3C0 0x560 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_05_XBAR_INOUT09      0x1D0 0x3C0 0x628 0x3 \
  0x1
#define MXRT1050_IOMUXC_GPIO_SD_B0_05_FLEXSPI_B_DQS     0x1D0 0x3C0 0x000 0x4 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_05_GPIO3_IO17      0x1D0 0x3C0 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B0_05_CCM_CLKO2       0x1D0 0x3C0 0x000 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B1_00_USDHC2_DATA3      0x1D4 0x3C4 0x5F4 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_00_FLEXSPI_B_DATA3     0x1D4 0x3C4 0x4C4 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_00_FLEXPWM1_PWM3_A     0x1D4 0x3C4 0x454 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_00_SAI1_TX_DATA03      0x1D4 0x3C4 0x598 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_00_LPUART4_TXD     0x1D4 0x3C4 0x544 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_00_GPIO3_IO00      0x1D4 0x3C4 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B1_01_USDHC2_DATA2      0x1D8 0x3C8 0x5F0 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_01_FLEXSPI_B_DATA2     0x1D8 0x3C8 0x4C0 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_01_FLEXPWM1_PWM3_B     0x1D8 0x3C8 0x464 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_01_SAI1_TX_DATA02      0x1D8 0x3C8 0x59C 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_01_LPUART4_RXD     0x1D8 0x3C8 0x540 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_01_GPIO3_IO01      0x1D8 0x3C8 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B1_02_USDHC2_DATA1      0x1DC 0x3CC 0x5EC 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_02_FLEXSPI_B_DATA1     0x1DC 0x3CC 0x4BC 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_02_FLEXPWM2_PWM3_A     0x1DC 0x3CC 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_02_SAI1_TX_DATA01      0x1DC 0x3CC 0x5A0 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_02_FLEXCAN1_TX     0x1DC 0x3CC 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_02_GPIO3_IO02      0x1DC 0x3CC 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_02_CCM_WAIT        0x1DC 0x3CC 0x000 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B1_03_USDHC2_DATA0      0x1E0 0x3D0 0x5E8 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_03_FLEXSPI_B_DATA0     0x1E0 0x3D0 0x4B8 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_03_FLEXPWM2_PWM3_B     0x1E0 0x3D0 0x484 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_03_SAI1_MCLK       0x1E0 0x3D0 0x58C 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_03_FLEXCAN1_RX     0x1E0 0x3D0 0x44C 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_03_GPIO3_IO03      0x1E0 0x3D0 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_03_CCM_PMIC_READY      0x1E0 0x3D0 0x3FC 0x6 \
  0x0

#define MXRT1050_IOMUXC_GPIO_SD_B1_04_USDHC2_CLK      0x1E4 0x3D4 0x5DC 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_04_FLEXSPI_B_SCLK      0x1E4 0x3D4 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_04_LPI2C1_SCL      0x1E4 0x3D4 0x4CC 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_04_SAI1_RX_SYNC      0x1E4 0x3D4 0x5A4 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_04_FLEXCAN1_A_SS1_B      0x1E4 0x3D4 0x000 \
  0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_04_GPIO3_IO04      0x1E4 0x3D4 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_04_CCM_STOP        0x1E4 0x3D4 0x000 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B1_05_USDHC2_CMD      0x1E8 0x3D8 0x5E4 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_05_FLEXSPI_A_DQS     0x1E8 0x3D8 0x4A4 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_05_LPI2C1_SDA      0x1E8 0x3D8 0x4D0 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_05_SAI1_RX_BCLK      0x1E8 0x3D8 0x590 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_05_FLEXCAN1_B_SS0_B      0x1E8 0x3D8 0x000 \
  0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_05_GPIO3_IO05      0x1E8 0x3D8 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B1_06_USDHC2_RESET_B      0x1EC 0x3DC 0x000 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_06_FLEXSPI_A_SS0_B     0x1EC 0x3DC 0x000 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_06_LPUART7_CTS_B     0x1EC 0x3DC 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_06_SAI1_RX_DATA00      0x1EC 0x3DC 0x594 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_06_LPSPI2_PCS0     0x1EC 0x3DC 0x4FC 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_06_GPIO3_IO06      0x1EC 0x3DC 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B1_07_SEMC_CSX1       0x1F0 0x3E0 0x000 0x0 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_07_FLEXSPI_A_SCLK      0x1F0 0x3E0 0x4C8 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_07_LPUART7_RTS_B     0x1F0 0x3E0 0x000 0x2 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_07_SAI1_TX_DATA00      0x1F0 0x3E0 0x000 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_07_LPSPI2_SCK      0x1F0 0x3E0 0x500 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_07_GPIO3_IO07      0x1F0 0x3E0 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_07_CCM_REF_EN_B      0x1F0 0x3E0 0x000 0x6 \
  0x0

#define MXRT1050_IOMUXC_GPIO_SD_B1_08_USDHC2_DATA4      0x1F4 0x3E4 0x5F8 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_08_FLEXSPI_A_DATA0     0x1F4 0x3E4 0x4A8 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_08_LPUART7_TXD     0x1F4 0x3E4 0x55C 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_08_SAI1_TX_BLCK      0x1F4 0x3E4 0x5A8 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_08_LPSPI2_SDO      0x1F4 0x3E4 0x508 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_08_GPIO3_IO08      0x1F4 0x3E4 0x000 0x5 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_08_SEMC_CSX2       0x1F4 0x3E4 0x000 0x6 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B1_09_USDHC2_DATA5      0x1F8 0x3E8 0x5FC 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_09_FLEXSPI_A_DATA1     0x1F8 0x3E8 0x4AC 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_09_LPUART7_RXD     0x1F8 0x3E8 0x558 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_09_SAI1_TX_SYNC      0x1F8 0x3E8 0x5AC 0x3 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_09_LPSPI2_SDI      0x1F8 0x3E8 0x504 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_09_GPIO3_IO09      0x1F8 0x3E8 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B1_10_USDHC2_DATA6      0x1FC 0x3EC 0x600 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_10_FLEXSPI_A_DATA2     0x1FC 0x3EC 0x4B0 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_10_LPUART2_RXD     0x1FC 0x3EC 0x52C 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_10_LPI2C2_SDA      0x1FC 0x3EC 0x4D8 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_10_LPSPI2_PCS2     0x1FC 0x3EC 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_10_GPIO3_IO10      0x1FC 0x3EC 0x000 0x5 0x0

#define MXRT1050_IOMUXC_GPIO_SD_B1_11_USDHC2_DATA7      0x200 0x3F0 0x604 0x0 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_11_FLEXSPI_A_DATA3     0x200 0x3F0 0x4B4 0x1 \
  0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_11_LPUART2_TXD     0x200 0x3F0 0x530 0x2 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_11_LPI2C2_SCL      0x200 0x3F0 0x4D4 0x3 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_11_LPSPI2_PCS3     0x200 0x3F0 0x000 0x4 0x0
#define MXRT1050_IOMUXC_GPIO_SD_B1_11_GPIO3_IO11      0x200 0x3F0 0x000 0x5 0x0

#endif /* _DT_BINDINGS_PINCTRL_IMXRT1050_PINFUNC_H */
